<template>
  <div>
    <v-row justify="center" align="center">
      <v-col cols="12" md="8">
        <h2>プライバシーポリシー</h2>
      </v-col>
    </v-row>
    <v-row justify="center" align="center">
      <v-col cols="12" md="8">
        <v-card flat>
          <v-card-text>
            <p class="font-normal">HackLab株式会社（以下「当社」という）では、法人携帯電話の販売やインターネットを利用したサービス提供を中心にさまざまな事業活動を行っています。当社では、お客様および当社の事業活動に関わるすべての方々（株主様、従業者などを含み、以下総称して「ご本人様」といいます）の個人情報が、個人情報保護法並びに個人の人格尊重（プライバシー保護）の理念の下に適正かつ慎重に取扱われるべきものであり、法令遵守のみならず、個人の権利利益と密接に関わるものであるという認識に基づき、個人情報の取扱いに際して以下の事項を誓約いたします。</p>
            <div>
              <ol>
                <li class="font-normal">個人情報の保護に関する法律、同法についての個人情報保護委員会ガイドラインその他の関係法令などを遵守するとともに、一般に公正妥当と認められる個人情報の取扱いに関する慣行に準拠し、適切に取扱います。また、適宜、取扱いの改善に努めます。</li>
                <li class="font-normal">個人情報の取扱いに関する規定を明確にし、従業員などに周知徹底します。また、取引先などに対しても適切に個人情報を取扱うように要請します。</li>
                <li class="font-normal">個人情報の取得に際しては、利用目的を特定して通知または公表し、必要な場合は利用の同意を得た上で、その利用目的に従って個人情報を取扱います。</li>
                <li class="font-normal">個人情報を取扱うに当たっては、原則として利用目的に必要な範囲内で保存期間を定めるものとし、法令により例外として扱うことが認められている場合を除き、保存期間経過または利用目的を達成した後は、個人情報を遅滞なく消去します。</li>
                <li class="font-normal">個人情報の漏えい、滅失、またはき損の防止を図るため、組織的、人的、物理的および技術的な安全管理措置を行います。並びに不適合が発生した場合、その原因を除去し再発しないように是正処置を行います。</li>
                <li class="font-normal">保有する個人情報について、お客様ご本人からの開示、訂正、削除、利用停止の依頼を所定の窓口でお受けして、誠意をもって対応します。</li>
                <li class="font-normal">事業の内容および規模を考慮し、適切な個人情報の取得、利用および提供を行います。特定された利用目的の達成に必要な範囲を超えて個人情報を取扱う場合の承認の手続きを定め、目的外利用がされていないことを監視するなど、目的外利用が行われないようにします。</li>
                <li class="font-normal">苦情および相談に対して適切かつ迅速に対応するため、苦情および相談対応の責任者や手順などを定めて対応します。また、問題の及ぶ範囲を最小限にするように適切に処置をします。</li>
                <li class="font-normal">定期的な内部監査、社会情勢の変化や技術の進歩などを通して、個人情報保護マネジメントシステムの継続的改善を行います。</li>
              </ol>
            </div>

            <div class="pt-5">
              <p>2022年5月1日 制定</p>
            </div>
          </v-card-text>
        </v-card>
      </v-col>
    </v-row>
  </div>
</template>

<script lang="ts">
import { defineComponent } from '@nuxtjs/composition-api'

export default defineComponent({
  name: 'LegalPrivacyPage',

  setup() {
    
  },
})
</script>

<style scoped>
.lower-roman {
  list-style-type: lower-roman
}
</style>

