<template>
  <div>
    <v-row justify="center" align="center">
      <v-col cols="12" md="8">
        <h2>利用規約</h2>
      </v-col>
    </v-row>
    <v-row justify="center" align="center">
      <v-col cols="12" md="8">
        <v-card flat>
          <v-card-text>
            <div>
              <h3 class="py-5">第一条（総則・適用範囲）</h3>
              <ol>
                <li class="font-normal">
                  この利用規約（以下「本規約」といいます。）は、HackLab株式会社（以下「当社」といいます。）が提供するNFTマーケットプレイスのデモサービス、その他当社が提供するサービス（以下総称して「本サービス」といいます。）の利用に関する条件を定めるものであり、本サービスの利用に関し、当社及び利用者に対して適用されます。
                </li>
                <li class="font-normal">
                  当社が、当社ウェブサイト上に本サービスに関して個別規定や追加規定を掲載する場合、それらは本規約の一部を構成するものとし、個別規定又は追加規定が本規約と抵触する場合には、個別規定又は追加規定が優先するものとします。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第二条（用語の定義）</h3>
              <p class="font-normal">
                本規約において、次の各号に掲げる用語の意義は、当該各号に定めるところに従います。
              </p>
              <ol>
                <li class="font-normal">
                  アカウント:
                  本サービス上でサードパーティのウォレットで発行されたブロックチェーンアドレスを登録し、当社により独自のIDが付与された者をいいます。。
                </li>
                <li class="font-normal">
                  コンテンツ:
                  利用者が本サービスを通じてアクセスすることができる情報（文章、画像、動画、音声、音楽その他のサウンド、イメージ、ソフトウェア、プログラム、コードその他のデータを含みますが、これらに限られません。）の総称をいいます。
                </li>
                <li class="font-normal">
                  当社ウェブサイト: 当社の運営するウェブサイトをいいます。
                </li>
                <li class="font-normal">
                  本規約に定める手続により本利用契約を締結のうえ、本サービスの利用登録を行った個人、及び法人をいいます。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第三条（アカウント）</h3>
              <ol>
                <li class="font-normal">
                  利用者は、ID登録に際して、以下の条件を守るものとします。
                </li>
                <ol class="lower-roman">
                  <li class="font-normal">
                    本サービス上の会員専用ページの入力欄に、自身に関する真実かつ正確なデータの入力を行うこと。
                  </li>
                  <li class="font-normal">
                    アカウント登録において、代理による登録を行わないこと。
                  </li>
                  <li class="font-normal">
                    ブロックチェーンアドレスをリンクする際に、他人のブロックチェーンアドレスでリンクを行わないこと。
                  </li>
                  <li class="font-normal">
                    iの入力事項に変更があった場合、利用者は速やかに登録内容の変更を行うこと。
                  </li>
                </ol>
                <li class="font-normal">
                  アカウントと関連付けたウォレットの該当するプロバイダーの条件の下でそのウォレットを使用していることに同意するものとします。ウォレットは当社ウェブサイトによって運営、維持、または提携されておらず、当社ウェブサイトはウォレットのコンテンツを管理または管理しておらず、そのコンテンツを取得または転送することはできません。
                </li>
                <li class="font-normal">
                  当社ウェブサイトは、利用者によるウォレットの使用に関連して、利用者に対して一切の責任を負わず、サービスが特定のウォレットでどのように機能するかについて、いかなる表明または保証も行いません。ウォレットを安全に保つ責任はあなたが単独で負うものであり、ウォレットの資格情報やシードフレーズを他人と共有してはなりません。
                </li>
                <li class="font-normal">
                  利用者は、自己が本サービスを利用する場合、サービス利用規約を確認し、同意した上で、当該サービスを利用するものとします。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第三条（禁止事項）</h3>
              <p class="font-normal">
                利用者は、対象サービスを利用するにあたり以下の行為または以下に該当するおそれがあると当社が判断する行為を行わないものとします。
              </p>
              <ol>
                <li class="font-normal">
                  他の利用者または第三者の著作権、肖像権、その他知的所有権を侵害する行為
                </li>
                <li class="font-normal">
                  他の利用者または第三者の財産、プライバシー等を侵害する行為
                </li>
                <li class="font-normal">
                  他の利用者または第三者に対する誹謗中傷、迷惑となる行為、不快感を抱かせる行為
                </li>
                <li class="font-normal">
                  当社のサーバー等のコンピュータに不正にアクセスしたり、有害なコンピュータプログラム、有害なメール等を送信または書き込む行為
                </li>
                <li class="font-normal">
                  対象サービスを商用目的で利用する行為
                </li>
                <li class="font-normal">犯罪的行為に結びつく行為</li>
                <li class="font-normal">
                  その他、法律、法令、公序良俗または本規約に違反する行為または違反のおそれのある行為
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第四条（規約違反の場合の措置等）</h3>
              <ol>
                <li class="font-normal">
                  利用者が以下の各号に該当した場合､当社は､当社の定める期間､本サービスの利用を認めないこと､又は､利用者のアカウントを取り消すことができるものとします｡
                </li>
                <ol class="lower-roman">
                  <li class="font-normal">
                    他の利用者又は第三者に不当に迷惑をかけたと当社が判断した場合
                  </li>
                  <li class="font-normal">本サービスの運営を妨げた場合</li>
                  <li class="font-normal">本規約に違反した場合</li>
                  <li class="font-normal">法令に違反した場合</li>
                  <li class="font-normal">
                    その他､利用者として不適切であると当社が判断した場合
                  </li>
                </ol>
                <li class="font-normal">
                  当社がアカウントを取り消した会員は再入会することはできません｡
                </li>
                <li class="font-normal">
                  当社の措置により会員に損害が生じたとしても､当社は､一切損害を賠償しません｡
                </li>
                <li class="font-normal">
                  利用者が本規約に違反し､当社､他の利用者又は第三者に損害を与えた場合、利用者は､その損害を賠償するものとします｡
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第五条（利用者による退会）</h3>
              <ol>
                <li class="font-normal">
                  利用者のアカウントは､当社の定める手続きにより退会することができるものとします｡
                </li>
                <li class="font-normal">
                  利用者のアカウントが退会した場合､当社は退会日から直ちにアカウント記述情報を削除することができるものとします｡
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第六条（秘密保持）</h3>
              <ol>
                <li class="font-normal">
                  利用者は、本サービスに関連して当社が秘密である旨指定して開示した非公知の情報（以下「秘密情報」といいます。）を秘密に取り扱うものとします。
                </li>
                <li class="font-normal">
                  利用者は、秘密情報を厳重に保管・管理しなければならず、当社の事前の書面による承諾がある場合を除き、第三者に開示、漏洩しないものとします。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第六条（個人情報の取扱い）</h3>
              <ol>
                <li class="font-normal">
                  当社は、対象サービスの管理・運営に当たって、当社が利用者から取得した個人情報は、当社が定めるプライバシーポリシーに従い、適切に取り扱うとともに、厳重に管理するものとします。
                </li>
                <li class="font-normal">
                  当社は、「個人情報保護方針」に基づき、本サービスの提供及びこれに付随する業務に必要な範囲で前項のプライバシーポリシーを業務委託先に委託することができるものとします。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第七条（サービスの変更）</h3>
              <ol>
                <li class="font-normal">
                  当社は、当社の裁量により本サービスの一部の内容を追加又は変更することができます。当社は、本条に基づく本サービスの追加又は変更により、変更前の本サービスの全ての機能・性能が維持されることを保証するものではありません。
                </li>
                <li class="font-normal">
                  当社は、前項に基づいて本サービスを追加又は変更したことによりユーザーに生じた損害及び不利益につき、一切の責任を負いません。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第八条（本サービスの終了・一時的な中断）</h3>
              <ol>
                <li class="font-normal">
                  当社は、当社の裁量で、本サービスを終了することができるものとします。
                </li>
                <li class="font-normal">
                  当社は、以下各号の事由が生じた場合には、本サービスの一部又は全部を一時的に中断することができるものとします。
                </li>
                <ol class="lower-roman">
                  <li class="font-normal">
                    システム等の保守を定期的に又は緊急に行う場合
                  </li>
                  <li class="font-normal">
                    アクセス過多、その他予期せぬ要因でシステムに負荷が集中した場合
                  </li>
                  <li class="font-normal">
                    利用者のセキュリティを確保する必要が生じた場合
                  </li>
                  <li class="font-normal">
                    電気通信事業者の役務が提供されない場合
                  </li>
                  <li class="font-normal">
                    第三者サービスの全部又は一部が提供されない場合
                  </li>
                  <li class="font-normal">
                    火災、停電等により本サービスの提供ができなくなった場合
                  </li>
                  <li class="font-normal">
                    地震、噴火、洪水、津波等の天災により本サービスの提供ができなくなった場合
                  </li>
                  <li class="font-normal">
                    戦争、動乱、暴動、騒乱、労働争議等により本サービスの提供ができなくなった場合
                  </li>
                  <li class="font-normal">
                    法令又はこれらに基づく措置により本サービスの運営ができなくなった場合
                  </li>
                  <li class="font-normal">
                    その他前各号に準じ当社が必要と判断した場合
                  </li>
                </ol>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第九条（反社会的勢力の排除）</h3>
              <ol>
                <li class="font-normal">
                  当社及び利用者は、次の各号に定める事項を現在及び将来にわたって表明し、保証します。
                </li>
                <ol class="lower-roman">
                  <li class="font-normal">
                    自らが暴力団（暴力団員による不当な行為の防止等に関する法律（以下｢暴対法｣といいます。）第2条第2号に規定する暴力団をいいます。以下同じ。）、暴力団員（同条第6号に規定する暴力団員。）、暴力団準構成員、暴力団員でなくなった時から５年を経過しない者、暴力団関係企業、総会屋等、社会運動等標榜ゴロ又は特殊知能暴力集団その他暴力、威力、詐欺的手法を用いて暴力的不法行為等（同条第1号に規定する行為をいいます。）を常習的に行う、又は自らの目的を達成することを常習とする集団又は個人（以下併せて「反社会的勢力」という。）に該当しないこと。
                  </li>
                  <li class="font-normal">
                    自己の代表者、役員又は主要な職員（雇用形態及び契約形態を問わない。）が反社会的勢力に該当しないこと。
                  </li>
                  <li class="font-normal">
                    自己の主要な出資者その他経営を支配していると認められる者が反社会的勢力に該当しないこと。
                  </li>
                  <li class="font-normal">
                    直接、間接を問わず、反社会的勢力が自己の経営に関与していないこと。
                  </li>
                  <li class="font-normal">
                    自己若しくは第三者の不正の利益を図る目的又は第三者に損害を加える目的をもってするなど、不当に反社会的勢力を利用していると認められる関係を有していないこと。
                  </li>
                  <li class="font-normal">
                    反社会的勢力に対して資金等の提供ないし便宜の供与等をしていないこと。
                  </li>
                  <li class="font-normal">
                    自己の代表者、役員又は経営に実質的に関与している者が反社会的勢力と社会的に非難されるべき関係を有していないこと。
                  </li>
                </ol>
                <li class="font-normal">
                  利用者は、自ら又は第三者をして次の各号に定める行為を行ってはなりません。
                </li>
                <ol class="lower-roman">
                  <li class="font-normal">
                    相手方又は第三者に対する暴対法第9条各号に定める暴力的要求行為
                  </li>
                  <li class="font-normal">
                    相手方又は第三者に対する法的な責任を超えた不当な要求行為
                  </li>
                  <li class="font-normal">
                    相手方又は第三者に対する、脅迫的な言動又は暴力を用いる行為
                  </li>
                  <li class="font-normal">
                    偽計又は威力を用いて相手方又は第三者の業務を妨害し、又は信用を毀損する行為
                  </li>
                </ol>
                <li class="font-normal">
                  当社及び利用者は、自らが第1項又は第2項の規定に違反している事実が判明した場合、直ちに当社にその事実を報告するものとします。
                </li>
                <li class="font-normal">
                  当社及び利用者は、相手方に対し、経済制裁対象者に該当せず、また経済制裁対象者との間で取引を行っていないことを表明し、将来にわたって、経済制裁対象者とならないこと、並びに経済制裁対象者との間で取引を行わないことをここに確約します。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第十条（免責）</h3>
              <ol>
                <li class="font-normal">
                  当社は、本サービスが全ての情報端末に対応していることを保証するものではなく、本サービスの利用に供する情報端末のＯＳ又はウェブブラウザのバージョンアップ等に伴い、本サービスの動作に不具合が生じる可能性があることにつき、利用者はあらかじめ了承するものとします。当社は、かかる不具合が生じた場合に当社が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。
                </li>
                <li class="font-normal">
                  当社は、本サービスについて、完全性、継続性、特定目的適合性、電子帳簿保存法における要件適合性、利用者が本サービスに基づき取得又は利用する一切の情報の内容の最新性、適時性、正確性、完全性その他いかなる保証もするものではなく、通信回線の障害その他事由の如何を問わず利用者が本サービスの提供を受けられなかったときでも、何ら責任を負わないものとします。
                </li>
                <li class="font-normal">
                  何らかの理由により当社が責任を負う場合であっても、当社は、付随的損害、間接損害、特別損害及び逸失損害については、賠償する責任を負わないものとします。
                </li>
                <li class="font-normal">
                  本サービスでは請求書などの発行の他、請求書などの郵送手続きを代行しますが、請求書発送先への郵送は委託先のサービスを利用します。そのため、委託先企業にて遅滞が発生したことを起因とする損害については、当社は何ら責任を負わないものとします。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第十一条（損害賠償）</h3>
              <ol>
                <li class="font-normal">
                  利用者は、本規約に違反することにより、又は本サービスの利用に関連して当社に損害を与えた場合、当社に対しその損害を賠償しなければなりません。
                </li>
                <li class="font-normal">
                  当社は、本サービスに関連して利用者その他の第三者が被った損害について、一切賠償の責任を負いません。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">第十二条（準拠法及び合意管轄）</h3>
              <ol>
                <li class="font-normal">
                  本規約は日本法に準拠するものとします。
                </li>
                <li class="font-normal">
                  本規約に起因し又は関連する一切の紛争については、東京地方裁判所を第一審の専属的合意管轄裁判所とします。
                </li>
              </ol>
            </div>

            <div>
              <h3 class="py-5">附則</h3>
              <p>2022年5月1日 制定</p>
            </div>
          </v-card-text>
        </v-card>
      </v-col>
    </v-row>
  </div>
</template>

<script lang="ts">
import { defineComponent } from '@nuxtjs/composition-api'

export default defineComponent({
  name: 'LegalTermsPage',

  setup() {},
})
</script>

<style scoped>
.lower-roman {
  list-style-type: lower-roman;
}
</style>
